Revit 2027 API
Reference.ElementId Property
The element id for this reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ElementId { get; }
Public ReadOnly Property ElementId As ElementId
	Get
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
member ElementId : ElementId with get
Property Value
ElementId
Remarks
InvalidElementId will be returned for references that don't refer to a particular element.
See Also
Reference
Reference Class
Autodesk.Revit.DB Namespace